Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.3.82/edc/ATSAML10E14A.PIC
      <edc:SFRDef edc:_addr="0xE0001FEC" edc:access="------------------------rrrrrrrr" edc:cname="DWT_PIDR3" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="CMOD" edc:desc="Customer Modified" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REVAND" edc:desc="RevAnd" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001FF0" edc:access="------------------------rrrrrrrr" edc:cname="DWT_CIDR0" edc:impl="0xFF" edc:mclr="00000000000000000000000000001101" edc:nzwidth="0x20" edc:por="00000000000000000000000000001101" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="PRMBL_0" edc:desc="CoreSight component identification preamble" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001FF4" edc:access="------------------------rrrrrrrr" edc:cname="DWT_CIDR1" edc:impl="0xFF" edc:mclr="00000000000000000000000010010000" edc:nzwidth="0x20" edc:por="00000000000000000000000010010000" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="PRMBL_1" edc:desc="CoreSight component identification preamble" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CLASS" edc:desc="CoreSight component class" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001FF8" edc:access="------------------------rrrrrrrr" edc:cname="DWT_CIDR2" edc:impl="0xFF" edc:mclr="00000000000000000000000000000101" edc:nzwidth="0x20" edc:por="00000000000000000000000000000101" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="PRMBL_2" edc:desc="CoreSight component identification preamble" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001FFC" edc:access="------------------------rrrrrrrr" edc:cname="DWT_CIDR3" edc:impl="0xFF" edc:mclr="00000000000000000000000010110001" edc:nzwidth="0x20" edc:por="00000000000000000000000010110001" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="PRMBL_3" edc:desc="CoreSight component identification preamble" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002000" edc:access="nnnn-------------nnnnnnnnnnn--nn" edc:cname="FP_CTRL" edc:impl="0xF0007FF3" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Flash Patch global enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="FP_CTRL write-enable key" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NUM_CODE" edc:desc="Number of implemented code comparators bits [3:0]" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="NUM_LIT" edc:desc="Number of literal comparators" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="NUM_CODE_1" edc:desc="Number of implemented code comparators bits [6:4]" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="REV" edc:desc="Revision" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002004" edc:access="--rrrrrrrrrrrrrrrrrrrrrrrrr-----" edc:cname="FP_REMAP" edc:impl="0x3FFFFFE0" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="REMAP" edc:desc="Remap address" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="RMPSPT" edc:desc="Remap supported" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002008" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="FP_COMP0" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="BE" edc:desc="Breakpoint enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BPADDR" edc:desc="Breakpoint address" edc:nzwidth="0x1F"/>
            <edc:AdjustPoint edc:offset="-30"/>
            <edc:SFRFieldDef edc:cname="FPADDR" edc:desc="Flash Patch address" edc:nzwidth="0x1B"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FE" edc:desc="Flash Patch enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000200C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="FP_COMP1" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="BE" edc:desc="Breakpoint enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BPADDR" edc:desc="Breakpoint address" edc:nzwidth="0x1F"/>
            <edc:AdjustPoint edc:offset="-30"/>
            <edc:SFRFieldDef edc:cname="FPADDR" edc:desc="Flash Patch address" edc:nzwidth="0x1B"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FE" edc:desc="Flash Patch enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002010" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="FP_COMP2" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="BE" edc:desc="Breakpoint enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BPADDR" edc:desc="Breakpoint address" edc:nzwidth="0x1F"/>
            <edc:AdjustPoint edc:offset="-30"/>
            <edc:SFRFieldDef edc:cname="FPADDR" edc:desc="Flash Patch address" edc:nzwidth="0x1B"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FE" edc:desc="Flash Patch enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002014" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="FP_COMP3" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="BE" edc:desc="Breakpoint enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BPADDR" edc:desc="Breakpoint address" edc:nzwidth="0x1F"/>
            <edc:AdjustPoint edc:offset="-30"/>
            <edc:SFRFieldDef edc:cname="FPADDR" edc:desc="Flash Patch address" edc:nzwidth="0x1B"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FE" edc:desc="Flash Patch enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE0002018" edc:offset="0xF98"/>
      <edc:SFRDef edc:_addr="0xE0002FB0" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="FP_LAR" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Lock access control" edc:nzwidth="0x20">
              <edc:SFRFieldSemantic edc:cname="UNLOCK" edc:desc="Unlock key value" edc:when="(field &amp; 0xFFFFFFFF) == 0xC5ACCE55"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0002FB4" edc:access="-----------------------------rrr" edc:cname="FP_LSR" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="SLI" edc:desc="Software Lock implemented" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLK" edc:desc="Software Lock status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="nTT" edc:desc="Not thirty-two bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE0002FB8" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE0002FBC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="FP_DEVARCH" edc:mclr="01000111011100000001101000000011" edc:nzwidth="0x20" edc:por="01000111011100000001101000000011" ltx:memberofperipheral="FPB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="ARCHPART" edc:desc="Architecture Part" edc:nzwidth="0xC"/>
            <edc:SFRFieldDef edc:cname="ARCHVER" edc:desc="Architecture Version" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="Revision" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PRESENT" edc:desc="DEVARCH Present" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARCHITECT" edc:desc="Architect" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
