Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.3.82/edc/ATSAML10E14A.PIC
      <edc:SFRDef edc:_addr="0xE000ED08" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnn-------" edc:cname="VTOR" edc:impl="0xFFFFFF80" edc:nzwidth="0x20" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TBLOFF" edc:desc="Vector table base offset" edc:nzwidth="0x19"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED0C" edc:access="nnnnnnnnnnnnnnnnnnn---------nnn-" edc:cname="AIRCR" edc:impl="0xFFFFE00E" edc:nzwidth="0x20" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VECTCLRACTIVE" edc:desc="Debug: Clear Active State" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Do not clear active state" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Clear active state" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SYSRESETREQ" edc:desc="System Reset Request" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Do not request a system reset" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Request a system reset" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SYSRESETREQS" edc:desc="System Reset Request Secure only" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="SYSRESETREQ functionality is available to both Security states" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SECURE" edc:desc="SYSRESETREQ functionality is only available to Secure state" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BFHFNMINS" edc:desc="BusFault, HardFault and NMI Non-secure enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SECURE" edc:desc="BusFault, HardFault, and NMI are Secure" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="NON_SECURE" edc:desc="BusFault and NMI are Non-secure and exceptions can target Non-secure HardFault" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PRIS" edc:desc="Prioritize Secure Exceptions" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SAME" edc:desc="Priority ranges of Secure and Non-secure exceptions are identical" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="NS_DEPRIO" edc:desc="Non-secure exceptions are de-prioritized" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ENDIANNESS" edc:desc="Data Endianness, 0=little, 1=big" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LITTLE" edc:desc="Little-endian" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="BIG" edc:desc="Big-endian" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="VECTKEY" edc:desc="Register Key (0x05FA)" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED10" edc:access="---------------------------nnnn-" edc:cname="SCR" edc:impl="0x1E" edc:nzwidth="0x20" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SLEEPONEXIT" edc:desc="Sleep on exit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="O not sleep when returning to Thread mode" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Enter sleep, or deep sleep, on return from an ISR" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLEEPDEEP" edc:desc="Sleep deep" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Sleep" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Deep sleep" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLEEPDEEPS" edc:desc="Sleep deep secure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEVONPEND" edc:desc="Send Event on Pending bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Enabled events and all interrupts, including disabled interrupts, can wakeup the processor" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED14" edc:access="-------------nnn-----n-n---nn-n-" edc:cname="CCR" edc:impl="0x7051A" edc:nzwidth="0x20" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="USERSETMPEND" edc:desc="User set main pending" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="UNALIGN_TRP" edc:desc="Unaligned trap" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Do not trap unaligned halfword and word accesses" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Trap unaligned halfword and word accesses" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIV_0_TRP" edc:desc="Divide by zero trap" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BFHFNMIGN" edc:desc="BusFault in HardFault or NMI ignore" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STKOFHFNMIGN" edc:desc="Stack overflow in HardFault and NMI ignore" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DC" edc:desc="Data cache enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC" edc:desc="Instruction cache enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BP" edc:desc="Branch prediction enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000ED18" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE000ED1C" edc:access="nnnnnnnn------------------------" edc:cname="SHPR2" edc:impl="0xFF000000" edc:nzwidth="0x20" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="PRI_11" edc:desc="Priority of system handler 11, SVCall" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED20" edc:access="nnnnnnnnnnnnnnnn--------nnnnnnnn" edc:cname="SHPR3" edc:impl="0xFFFF00FF" edc:nzwidth="0x20" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="PRI_12" edc:desc="Priority of system handler 12, DebugMonitor" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_14" edc:desc="Priority of system handler 14, PendSV" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_15" edc:desc="Priority of system handler 15, SysTick" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED24" edc:access="----------n-----n---nn--n-n--n--" edc:cname="SHCSR" edc:impl="0x208CA4" edc:nzwidth="0x20" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="HARDFAULTACT" edc:desc="HardFault exception active state" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NMIACT" edc:desc="NMI exception active state" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SVCALLACT" edc:desc="SVCall exception active state" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PENDSVACT" edc:desc="PendSV exception active state" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYSTICKACT" edc:desc="SysTick exception active state" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SVCALLPENDED" edc:desc="SVCall exception pended state" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="HARDFAULTPENDED" edc:desc="HardFault exception pended state" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000ED28" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0xE000ED30" edc:access="---------------------------nnnnn" edc:cname="DFSR" edc:impl="0x1F" edc:nzwidth="0x20" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="HALTED" edc:desc="Halt or step event" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BKPT" edc:desc="Breakpoint event" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DWTTRAP" edc:desc="Watchpoint event" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VCATCH" edc:desc="Vector Catch event" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTERNAL" edc:desc="External event" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000ED34" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0xE000ED3C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AFSR" edc:nzwidth="0x20" ltx:memberofperipheral="SCB"/>
      <edc:AdjustPoint edc:_addr="0xE000ED40" edc:offset="0x38"/>
      <edc:SFRDef edc:_addr="0xE000ED78" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CLIDR" edc:nzwidth="0x20" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="Ctype1" edc:desc="Cache type at level 1" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No cache" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IC" edc:desc="Instruction cache only" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DC" edc:desc="Data cache only" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SEPARATE" edc:desc="Separate instruction and data caches" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="UNIFIED" edc:desc="Unified cache" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="Ctype2" edc:desc="Cache type at level 2" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No cache" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IC" edc:desc="Instruction cache only" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DC" edc:desc="Data cache only" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SEPARATE" edc:desc="Separate instruction and data caches" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="UNIFIED" edc:desc="Unified cache" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="Ctype3" edc:desc="Cache type at level 3" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No cache" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IC" edc:desc="Instruction cache only" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DC" edc:desc="Data cache only" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SEPARATE" edc:desc="Separate instruction and data caches" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="UNIFIED" edc:desc="Unified cache" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="Ctype4" edc:desc="Cache type at level 4" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No cache" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IC" edc:desc="Instruction cache only" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DC" edc:desc="Data cache only" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SEPARATE" edc:desc="Separate instruction and data caches" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="UNIFIED" edc:desc="Unified cache" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="Ctype5" edc:desc="Cache type at level 5" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No cache" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IC" edc:desc="Instruction cache only" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DC" edc:desc="Data cache only" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SEPARATE" edc:desc="Separate instruction and data caches" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="UNIFIED" edc:desc="Unified cache" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="Ctype6" edc:desc="Cache type at level 6" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No cache" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IC" edc:desc="Instruction cache only" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DC" edc:desc="Data cache only" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SEPARATE" edc:desc="Separate instruction and data caches" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="UNIFIED" edc:desc="Unified cache" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="Ctype7" edc:desc="Cache type at level 7" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No cache" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IC" edc:desc="Instruction cache only" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DC" edc:desc="Data cache only" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SEPARATE" edc:desc="Separate instruction and data caches" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="UNIFIED" edc:desc="Unified cache" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LoUIS" edc:desc="Level of Unification Inner Shareable" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="LoC" edc:desc="Level of Coherence" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="LoUU" edc:desc="Level of Unification Uniprocessor" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ICB" edc:desc="Inner cache boundary" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Not disclosed in this mechanism" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="L1" edc:desc="L1 cache is the highest inner level" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="L2" edc:desc="L2 cache is the highest inner level" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="L3" edc:desc="L3 cache is the highest inner level" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
