Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.3.82/edc/ATSAML10E14A.PIC
      <edc:SFRDef edc:_addr="0x4200012A" edc:access="----nnnn" edc:cname="USER10" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200012B" edc:access="----nnnn" edc:cname="USER11" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200012C" edc:access="----nnnn" edc:cname="USER12" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200012D" edc:access="----nnnn" edc:cname="USER13" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200012E" edc:access="----nnnn" edc:cname="USER14" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200012F" edc:access="----nnnn" edc:cname="USER15" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000130" edc:access="----nnnn" edc:cname="USER16" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000131" edc:access="----nnnn" edc:cname="USER17" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000132" edc:access="----nnnn" edc:cname="USER18" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000133" edc:access="----nnnn" edc:cname="USER19" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000134" edc:access="----nnnn" edc:cname="USER20" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000135" edc:access="----nnnn" edc:cname="USER21" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000136" edc:access="----nnnn" edc:cname="USER22" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42000137" edc:offset="0x9D"/>
      <edc:SFRDef edc:_addr="0x420001D4" edc:access="-------n" edc:cname="INTENCLR" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:desc="Non-Secure Check Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420001D5" edc:access="-------n" edc:cname="INTENSET" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:desc="Non-Secure Check Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420001D6" edc:access="-------n" edc:cname="INTFLAG" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:desc="Non-Secure Check" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x420001D7" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x420001D8" edc:access="------------------------nnnnnnnn" edc:cname="NONSECCHAN" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL0" edc:desc="Non-Secure for Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL1" edc:desc="Non-Secure for Channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL2" edc:desc="Non-Secure for Channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL3" edc:desc="Non-Secure for Channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL4" edc:desc="Non-Secure for Channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL5" edc:desc="Non-Secure for Channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL6" edc:desc="Non-Secure for Channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL7" edc:desc="Non-Secure for Channel 7" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420001DC" edc:access="------------------------nnnnnnnn" edc:cname="NSCHKCHAN" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL0" edc:desc="Channel 0 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL1" edc:desc="Channel 1 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL2" edc:desc="Channel 2 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL3" edc:desc="Channel 3 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL4" edc:desc="Channel 4 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL5" edc:desc="Channel 5 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL6" edc:desc="Channel 6 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL7" edc:desc="Channel 7 to be checked as non-secured" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420001E0" edc:access="---------nnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NONSECUSER0" edc:impl="0x7FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USER0" edc:desc="Non-Secure for User 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER1" edc:desc="Non-Secure for User 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER2" edc:desc="Non-Secure for User 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER3" edc:desc="Non-Secure for User 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER4" edc:desc="Non-Secure for User 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER5" edc:desc="Non-Secure for User 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER6" edc:desc="Non-Secure for User 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER7" edc:desc="Non-Secure for User 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER8" edc:desc="Non-Secure for User 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER9" edc:desc="Non-Secure for User 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER10" edc:desc="Non-Secure for User 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER11" edc:desc="Non-Secure for User 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER12" edc:desc="Non-Secure for User 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER13" edc:desc="Non-Secure for User 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER14" edc:desc="Non-Secure for User 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER15" edc:desc="Non-Secure for User 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER16" edc:desc="Non-Secure for User 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER17" edc:desc="Non-Secure for User 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER18" edc:desc="Non-Secure for User 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER19" edc:desc="Non-Secure for User 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER20" edc:desc="Non-Secure for User 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER21" edc:desc="Non-Secure for User 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER22" edc:desc="Non-Secure for User 22" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x420001E4" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x420001F0" edc:access="---------nnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NSCHKUSER0" edc:impl="0x7FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USER0" edc:desc="User 0 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER1" edc:desc="User 1 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER2" edc:desc="User 2 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER3" edc:desc="User 3 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER4" edc:desc="User 4 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER5" edc:desc="User 5 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER6" edc:desc="User 6 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER7" edc:desc="User 7 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER8" edc:desc="User 8 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER9" edc:desc="User 9 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER10" edc:desc="User 10 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER11" edc:desc="User 11 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER12" edc:desc="User 12 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER13" edc:desc="User 13 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER14" edc:desc="User 14 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER15" edc:desc="User 15 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER16" edc:desc="User 16 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER17" edc:desc="User 17 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER18" edc:desc="User 18 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER19" edc:desc="User 19 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER20" edc:desc="User 20 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER21" edc:desc="User 21 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER22" edc:desc="User 22 to be checked as non-secured" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x420001F4" edc:offset="0xE0C"/>
      <edc:SFRDef edc:_addr="0x42001000" edc:access="---nn-nn--nn--nn----nnnnnnnnnnnn" edc:cname="CTRLA" edc:impl="0x1B330FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Timer Counter Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="COUNT16" edc:desc="Counter in 16-bit mode" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="COUNT8" edc:desc="Counter in 8-bit mode" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="COUNT32" edc:desc="Counter in 32-bit mode" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PRESCSYNC" edc:desc="Prescaler and Counter Synchronization" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="Reload or reset the counter on next generic clock" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESC" edc:desc="Reload or reset the counter on next prescaler clock" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RESYNC" edc:desc="Reload or reset the counter on next generic clock and reset the prescaler counter" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run during Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="Clock On Demand" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:desc="Prescaler" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Prescaler: GCLK_TC" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Prescaler: GCLK_TC/2" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Prescaler: GCLK_TC/4" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Prescaler: GCLK_TC/8" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Prescaler: GCLK_TC/16" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Prescaler: GCLK_TC/64" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="Prescaler: GCLK_TC/256" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="Prescaler: GCLK_TC/1024" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ALOCK" edc:desc="Auto Lock" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CAPTEN0" edc:desc="Capture Channel 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAPTEN1" edc:desc="Capture Channel 1 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="COPEN0" edc:desc="Capture On Pin 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COPEN1" edc:desc="Capture On Pin 1 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CAPTMODE0" edc:desc="Capture Mode Channel 0" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Default capture" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CAPTMIN" edc:desc="Minimum capture" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CAPTMAX" edc:desc="Maximum capture" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CAPTMODE1" edc:desc="Capture mode Channel 1" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Default capture" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CAPTMIN" edc:desc="Minimum capture" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CAPTMAX" edc:desc="Maximum capture" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
