Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.3.82/edc/ATSAML10E14A.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="VSW"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA30" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT6" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X18" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="Y18" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC1"/>
      <edc:VirtualPin edc:name="DRV18" edc:ppsfunction="F" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA31" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT7" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X19" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="Y19" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC1"/>
      <edc:VirtualPin edc:name="DRV19" edc:ppsfunction="F" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
